{"get_urls":[
{"name": "Get A List Of All Users In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/users", "description": "This endpoint returns the list of all user accounts in your Bild account, along with their IDs, names, emails, roles, and the projects they have access to."},
{"name": "Get A List Of All Projects In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects", "description": "This endpoint returns all projects that the user has access to. If the user is an admin or has access to all projects in your Bild account, it returns them all. Each item contains the project's ID, name, users who are part of the project along with their IDs, names, and access types, as well as the default branch of the project."},
{"name": "Get A List Of All Users In Your Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/users", "description": "This endpoint returns all users who are part of the project. Each item contains the user's ID, name, email, and access type."},
{"name": "Get All Branches Of The Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches", "description": "This endpoint returns all branches of the given project, including their IDs and names."},
{"name": "Get Commits Of The Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/commits", "description": "This endpoint returns all commits of the project, providing a history of all file update activities across branches with pagination. For the first page, provide the pageSize parameter in the query parameters. For subsequent pages, provide the lastEvaluatedKey received as a response from the previous call."},
{"name": "Get Commits Of The Branch", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/commits", "description": "This endpoint returns all commits of the branch, providing a history of all file update activities within the branch with pagination. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call."},
{"name": "Get Details Of The Commit", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/commits/{commitID}", "description": "This endpoint returns details of the commit for the given commitID, along with all the files involved in that commit. Each file will include its ID, name, part number, and revision number at the time of the commit."},
{"name": "Get Released Files After Given Time", "request_type": "GET", "url": "https://sandbox-api.getbild.com/files/released", "description": "This endpoint returns all files that were released after the given time. If a file is released multiple times, it will only return the latest instance for that file. The time is expected in Unix timestamp (Epoch), including milliseconds."},
{"name": "Get All Files Of The Project'S Default Branch", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/files", "description": "This endpoint returns all the latest versions of files from the project's default branch. Each entry will include fields such as name, id, type, path, latestVersionID etc. Response can be a flat list of files or a file-folder tree structure. By default, it'll be a file-folder tree structure."},
{"name": "Get All Files For A Branch", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files", "description": "This endpoint returns all the latest versions of files for the given branch ID. Each entry will include fields such as name, fileID, path, and latestVersionID. Response can be queried as a flat list of files or a file-folder tree structure. By default, it'll be a file-folder tree structure."},
{"name": "Get All Versions Of File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/versions", "description": "This endpoint returns all file versions for the given fileID. Each version entry will contain basic file details such as name, id, and path, along with metadata. Please note that, metadata will be just \"File Properties\" data. For more detailed metadata, use /projects/{projectID}/branches/{branchID}/files/{fileID}/metadata and other metadata APIs."},
{"name": "Get Latest Version Of File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/latest", "description": "This endpoint retrieves details of the latest file version."},
{"name": "Get Latest Released Version Of File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/released", "description": "This endpoint retrieves details of the latest released file."},
{"name": "Get The File Version", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/versions/{fileVersionID}", "description": "This endpoint retrieves file version details for the given fileVersionID."},
{"name": "Get A List Of Public Shared Files Links In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/sharedLinks", "description": "This endpoint returns all public shared file links in your Bild account in paginated format. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. The shared link contains details such as name, type, and the public URL."},
{"name": "Get A List Of Public Shared Files Links In Your Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/sharedLinks", "description": "This endpoint returns all public shared file links in your project in paginated format. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. The shared link contains details such as name, type, and the public URL."},
{"name": "Get A List Of Public Shared Files Links In Your Branch", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/sharedLinks", "description": "This endpoint returns all public shared file links in your branch in paginated format. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. The shared link contains details such as name, type, and the public URL."},
{"name": "Get A List Of All Custom Metadata Fields", "request_type": "GET", "url": "https://sandbox-api.getbild.com/metadataFields", "description": "This endpoint returns all metadata fields, including Bild's default fields and custom fields created by users."},
{"name": "Get Complete Metadata For File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/metadata", "description": "This endpoint returns metadata details for the file version associated with the given fileID. Metadata includes all fields and values across all available configs/profiles. By default, users will get metadata for the latest versions of the file."},
{"name": "Get Complete Metadata For The File Version", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/versions/{fileVersionID}/metadata", "description": "This endpoint returns metadata details for the fileVersionID. Metadata includes all fields and values across all available configs/profiles."},
{"name": "Get A List Of Feedback Items In Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/feedbackItems", "description": "This endpoint returns all feedback items in the project with pagination. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. Each feedback item contains details such as title, description, status, due date, tags, assignees, comments, attachments, etc."},
{"name": "Get A List Of Feedback Items For A File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/feedbackItems", "description": "This endpoint returns all feedback items for a file. Each feedback item contains details such as title, description, status, due date, tags, assignees, comments, attachments, etc."},
{"name": "Get Feedback Item Details For Given Feedback Item Id", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/feedbackItems/{feedbackItemID}", "description": "This endpoint returns feedback item details for the given feedback item ID. Each feedback item contains details such as title, description, status, due date, tags, assignees, comments, attachments, etc."},
{"name": "Get A List Of Packages In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/packages", "description": "This endpoint returns all packages in your Bild account. The results are paginated. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. Each package contains basic details such as name, creator name, created date, number of files, etc."},
{"name": "Get A List Of Packages In Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/packages", "description": "This endpoint returns all packages in the project in paginated format. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. Each package contains basic details such as name, creator name, created date, number of files, etc."},
{"name": "Get Detailed Package Info For The Given Id", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/packages/{packageID}", "description": "This endpoint retrieves details of all package information, including all files in the package. Each package contains details such as name, creator name, created date, a list of files, and a download URL for the package."},
{"name": "Get A List Of ECOs In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/ecos", "description": "This endpoint returns all Engineering Change Orders (ECOs) in your company's Bild account. The API supports paginated queries of ECOs. Users can pass pageSize and lastEvaluatedKey. PageSize determines the number of records per page, while lastEvaluatedKey serves as an offset key similar to database pagination. In the first API call, you'll receive the lastEvaluatedKey, which can be used in the next API call."},
{"name": "Get A List Of ECOs In The Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/ecos", "description": "This endpoint returns all Engineering Change Orders (ECOs) in the given project. Similar to the above, the API supports pagination with pageSize and lastEvaluatedKey, along with filtering the responses based on the status of the ECO."},
{"name": "Get ECOs Of Particular Branch Of The Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/ecos", "description": "This endpoint returns all Engineering Change Orders (ECOs) in the given branch of the project. Similar to the above, the API supports pagination with pageSize and lastEvaluatedKey, along with filtering the responses based on the status of the ECO."},
{"name": "Get ECOs Of Particular File Of The Branch In The Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/ecos", "description": "This endpoint returns all Engineering Change Orders (ECOs) in the given file of the branch in the project. Similar to the above, the API supports pagination with pageSize and lastEvaluatedKey, along with filtering the responses based on the status of the ECO."},
{"name": "Get Details Of An ECO", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/ecos/{ecoID}", "description": "This endpoint returns details of an Engineering Change Order (ECO), along with all the file versions involved in that ECO. It also provides the list of all approvals that are part of that ECO."},
{"name": "Get All Part Files & Sub-Assemblies Of An Assembly File", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/branches/{branchID}/files/{fileID}/closure", "description": "This endpoint returns a list of all part files and sub-assemblies of an assembly file. It provides the full closure of the file, i.e., the list of all part files and sub-assemblies of an assembly file. These closures are configuration-specific. This endpoint is useful for obtaining the full closure of the file when the user intends to release/cancel the ECO for assembly file along with all its part files and sub-assemblies."},
{"name": "Get A List Of Approval Requests In Your Bild Account", "request_type": "GET", "url": "https://sandbox-api.getbild.com/approvals", "description": "This endpoint returns all approval requests in your Bild account. By default, it returns the active approvals, i.e. Approvals those are PENDING in status. Pagination is supported using pageSize and lastEvaluatedKey, similar to the above APIs."},
{"name": "Get A List Of Approval Requests In Project", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/approvals", "description": "This endpoint returns all approval requests in the project in paginated format. By default, it returns the active approvals, i.e. Approvals those are PENDING in status. For the first page, simply pass the pageSize in the query parameters. For subsequent pages, pass the lastEvaluatedKey received as a response from the previous call. Each approval request contains basic details such as name, creator name, created date, file name, etc., along with the list of active reviewers."},
{"name": "Get Details Of An Approval Request", "request_type": "GET", "url": "https://sandbox-api.getbild.com/projects/{projectID}/approvals/{approvalID}", "description": "This endpoint returns details of an approval request along with active reviewers."}
]}